Documents/бит_РасчетПредельногоИндексаОбщедомовыхЗатрат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_РасчетПредельногоИндексаОбщедомовыхЗатрат</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.бит_РасчетПредельногоИндексаПоУслугамЖКХ</xr:Item>
				<xr:Item>AccumulationRegister.бит_НачисленияПоУслугамЖКХ</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>AccumulationRegister.бит_НачисленияПоУслугамЖКХПоПериоду</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВводВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокЛицевыхСчетов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокУлиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Начисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГруппаУслуги</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
								<v8:Type>cfg:CatalogRef.бит_ГруппыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдИзм</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Начислено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачисленоДо</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Норма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъемПоНормативам</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъемПоНормативамДо</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъемПоСчетчикам</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодСравнения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлановаяСтавка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлановаяСтавкаДо</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ПоставщикиУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Превышение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПревышениеВПроцентах</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредельныйИндекс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СверхномСтавка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СверхномСтавкаДо</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СверхНорма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ставка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаДо</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто1</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто2</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто3</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКУ1</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКУ2</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКУ3</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНедополученныхДоходов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетАбонента</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетКУ</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тариф</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифДо</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Факт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/бит_СведенияОРазмереПредельногоИндексаПоГруппеУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_СведенияОРазмереПредельногоИндексаПоГруппеУслуг</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Начислять</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредельныйИндексИзмененияПлатыЗаКоммунальныеРесурсы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодСравнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/бит_РасчетПредельногоИндексаОбщедомовыхЗатрат/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ПроцедурыИФункцииОбщегоНазначения

// Функция получает тип объекта.
//
// Параметры:
//  ОбъектСсылка - ДокументСсылка.
//
// Возвращаемое значение:
//  ТипОбъекта - Тип.
// 
&НаСервереБезКонтекста 
Функция ПолучитьТипОбъекта(ОбъектСсылка)
	
	ИмяОбъекта = ОбъектСсылка.Метаданные().Имя;
	ТипОбъекта = Тип("ДокументОбъект." + ИмяОбъекта);
	
	Возврат ТипОбъекта;
	
КонецФункции // ПолучитьТипОбъекта()

&НаСервере
Процедура ВызватьРасчет()
	
	ОтказОтРасчета = Ложь;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	бит_СведенияОРазмереПредельногоИндексаПоГруппеУслугСрезПоследних.ПериодСравнения
	|ИЗ
	|	РегистрСведений.бит_СведенияОРазмереПредельногоИндексаПоГруппеУслуг.СрезПоследних(
	|			&Момент,
	|			Организация = &Организация
	|				И Начислять = ИСТИНА) КАК бит_СведенияОРазмереПредельногоИндексаПоГруппеУслугСрезПоследних");
	
	Запрос.УстановитьПараметр("Момент",      Объект.Дата);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 0 Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Перед проведением расчета заполните, пожалуйста, регистр сведений ""Сведения о размере предельного индекса по группе услуг""" + Символы.ПС +
		                  "для " + Строка(Объект.Организация) + " на дату равную или ранее " +Строка(Объект.Дата);
		Сообщение.Сообщить();
		
		ОтказОтРасчета = Истина;
		
	КонецЕсли;
	
	Если Не ОтказОтРасчета Тогда
		
		ДокументОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
		
		ДокументОбъект.ВыполнитьРасчет();
		
		ЗначениеВДанныеФормы(ДокументОбъект, Объект);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.ВводВручную Тогда
		
		Элементы.ЛицевыеСчетаЛицевойСчет.ТолькоПросмотр                                = Ложь;
		Элементы.ЛицевыеСчетаГруппаУслуги.ТолькоПросмотр                               = Ложь;
		Элементы.ЛицевыеСчетаУслуга.ТолькоПросмотр                                     = Ложь; 
		Элементы.ЛицевыеСчетаПоставщик.ТолькоПросмотр                                  = Ложь;
		Элементы.ЛицевыеСчетаЕдИзм.ТолькоПросмотр                                      = Ложь;
		Элементы.ЛицевыеСчетаПериодСравнения.ТолькоПросмотр                            = Ложь;
		Элементы.ЛицевыеСчетаКоличество.ТолькоПросмотр                                 = Ложь;
		Элементы.ЛицевыеСчетаСтавкаДействующаяВПериодеСравнения.ТолькоПросмотр         = Ложь;
		Элементы.ЛицевыеСчетаСтавкаДействующаяВТекущемПериоде.ТолькоПросмотр           = Ложь;
		Элементы.ЛицевыеСчетаНорма.ТолькоПросмотр                                      = Ложь;
		Элементы.ЛицевыеСчетаНормативДействующийВПериодеСравнения.ТолькоПросмотр       = Ложь;
		Элементы.ЛицевыеСчетаНормативДействующийВТекущемПериоде.ТолькоПросмотр         = Ложь;
		Элементы.ЛицевыеСчетаСверхНорма.ТолькоПросмотр                                 = Ложь;
		Элементы.ЛицевыеСчетаПлановаяСтавкаДействующаяВПериодеСравнения.ТолькоПросмотр = Ложь;
		Элементы.ЛицевыеСчетаПлановаяСтавкаДействующаяВТекущемПериоде.ТолькоПросмотр   = Ложь;
		Элементы.ЛицевыеСчетаТарифДействующийВПериодеСравнения.ТолькоПросмотр          = Ложь;
		Элементы.ЛицевыеСчетаТарифДействующийВТекущемПериоде.ТолькоПросмотр            = Ложь;
		Элементы.ЛицевыеСчетаОбъемПоНормативамДо.ТолькоПросмотр                        = Ложь;
		Элементы.ЛицевыеСчетаОбъемПоНормативам.ТолькоПросмотр                          = Ложь;
		Элементы.ЛицевыеСчетаОбъем.ТолькоПросмотр                                      = Ложь;
		Элементы.ЛицевыеСчетаПредельныйИндекс.ТолькоПросмотр                           = Ложь;
		Элементы.ЛицевыеСчетаНачисленоПоУслугеДо.ТолькоПросмотр                        = Ложь;
		Элементы.ЛицевыеСчетаНачисленоПоУслуге.ТолькоПросмотр                          = Ложь;
		Элементы.ЛицевыеСчетаПревышение.ТолькоПросмотр                                 = Ложь;
		Элементы.ЛицевыеСчетаПревышениеВПроцентах.ТолькоПросмотр                       = Ложь;
		Элементы.ЛицевыеСчетаСуммаНедополученныхДоходов.ТолькоПросмотр                 = Ложь;
		
	Иначе
		
		Элементы.ЛицевыеСчетаЛицевойСчет.ТолькоПросмотр                                = Истина;
		Элементы.ЛицевыеСчетаГруппаУслуги.ТолькоПросмотр                               = Истина;
		Элементы.ЛицевыеСчетаУслуга.ТолькоПросмотр                                     = Истина; 
		Элементы.ЛицевыеСчетаПоставщик.ТолькоПросмотр                                  = Истина;
		Элементы.ЛицевыеСчетаЕдИзм.ТолькоПросмотр                                      = Истина;
		Элементы.ЛицевыеСчетаПериодСравнения.ТолькоПросмотр                            = Истина;
		Элементы.ЛицевыеСчетаКоличество.ТолькоПросмотр                                 = Истина;
		Элементы.ЛицевыеСчетаСтавкаДействующаяВПериодеСравнения.ТолькоПросмотр         = Истина;
		Элементы.ЛицевыеСчетаСтавкаДействующаяВТекущемПериоде.ТолькоПросмотр           = Истина;
		Элементы.ЛицевыеСчетаНорма.ТолькоПросмотр                                      = Истина;
		Элементы.ЛицевыеСчетаНормативДействующийВПериодеСравнения.ТолькоПросмотр       = Истина;
		Элементы.ЛицевыеСчетаНормативДействующийВТекущемПериоде.ТолькоПросмотр         = Истина;
		Элементы.ЛицевыеСчетаСверхНорма.ТолькоПросмотр                                 = Истина;
		Элементы.ЛицевыеСчетаПлановаяСтавкаДействующаяВПериодеСравнения.ТолькоПросмотр = Истина;
		Элементы.ЛицевыеСчетаПлановаяСтавкаДействующаяВТекущемПериоде.ТолькоПросмотр   = Истина;
		Элементы.ЛицевыеСчетаТарифДействующийВПериодеСравнения.ТолькоПросмотр          = Истина;
		Элементы.ЛицевыеСчетаТарифДействующийВТекущемПериоде.ТолькоПросмотр            = Истина;
		Элементы.ЛицевыеСчетаОбъемПоНормативамДо.ТолькоПросмотр                        = Истина;
		Элементы.ЛицевыеСчетаОбъемПоНормативам.ТолькоПросмотр                          = Истина;
		Элементы.ЛицевыеСчетаОбъем.ТолькоПросмотр                                      = Истина;
		Элементы.ЛицевыеСчетаПредельныйИндекс.ТолькоПросмотр                           = Истина;
		Элементы.ЛицевыеСчетаНачисленоПоУслугеДо.ТолькоПросмотр                        = Истина;
		Элементы.ЛицевыеСчетаНачисленоПоУслуге.ТолькоПросмотр                          = Истина;
		Элементы.ЛицевыеСчетаПревышение.ТолькоПросмотр                                 = Истина;
		Элементы.ЛицевыеСчетаПревышениеВПроцентах.ТолькоПросмотр                       = Истина;
		Элементы.ЛицевыеСчетаСуммаНедополученныхДоходов.ТолькоПросмотр                 = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандныхПанелейФормы

&НаКлиенте
Процедура Рассчитать(Команда)
	
	Если НЕ Объект.Проведен Тогда
		
		Объект.Начисления.Очистить();
		
		ВызватьРасчет();
		
	Иначе
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Перед выполнением расчетов, распроведите документ.");
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура УлицаПриИзменении(Элемент)
	
	Объект.Здание = Неопределено;
	
	Объект.Начисления.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗданиеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если НЕ ВыбранноеЗначение = Объект.Здание Тогда
	
		Объект.Начисления.Очистить();
	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗданиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Организация", Объект.Организация);
	Отбор.Вставить("Улица"      , Объект.Улица);
	
	ОткрытьФорму("Справочник.бит_СписокЗданий.Форма.ФормаВыбораУправляемая", Новый Структура("Отбор", Отбор), Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ВводВручнуюПриИзменении(Элемент)
	
	Если Объект.ВводВручную Тогда
		
		Элементы.ЛицевыеСчетаЛицевойСчет.ТолькоПросмотр                                = Ложь;
		Элементы.ЛицевыеСчетаГруппаУслуги.ТолькоПросмотр                               = Ложь;
		Элементы.ЛицевыеСчетаУслуга.ТолькоПросмотр                                     = Ложь; 
		Элементы.ЛицевыеСчетаПоставщик.ТолькоПросмотр                                  = Ложь;
		Элементы.ЛицевыеСчетаЕдИзм.ТолькоПросмотр                                      = Ложь;
		Элементы.ЛицевыеСчетаПериодСравнения.ТолькоПросмотр                            = Ложь;
		Элементы.ЛицевыеСчетаКоличество.ТолькоПросмотр                                 = Ложь;
		Элементы.ЛицевыеСчетаСтавкаДействующаяВПериодеСравнения.ТолькоПросмотр         = Ложь;
		Элементы.ЛицевыеСчетаСтавкаДействующаяВТекущемПериоде.ТолькоПросмотр           = Ложь;
		Элементы.ЛицевыеСчетаНорма.ТолькоПросмотр                                      = Ложь;
		Элементы.ЛицевыеСчетаНормативДействующийВПериодеСравнения.ТолькоПросмотр       = Ложь;
		Элементы.ЛицевыеСчетаНормативДействующийВТекущемПериоде.ТолькоПросмотр         = Ложь;
		Элементы.ЛицевыеСчетаСверхНорма.ТолькоПросмотр                                 = Ложь;
		Элементы.ЛицевыеСчетаПлановаяСтавкаДействующаяВПериодеСравнения.ТолькоПросмотр = Ложь;
		Элементы.ЛицевыеСчетаПлановаяСтавкаДействующаяВТекущемПериоде.ТолькоПросмотр   = Ложь;
		Элементы.ЛицевыеСчетаТарифДействующийВПериодеСравнения.ТолькоПросмотр          = Ложь;
		Элементы.ЛицевыеСчетаТарифДействующийВТекущемПериоде.ТолькоПросмотр            = Ложь;
		Элементы.ЛицевыеСчетаОбъемПоНормативамДо.ТолькоПросмотр                        = Ложь;
		Элементы.ЛицевыеСчетаОбъемПоНормативам.ТолькоПросмотр                          = Ложь;
		Элементы.ЛицевыеСчетаОбъем.ТолькоПросмотр                                      = Ложь;
		Элементы.ЛицевыеСчетаПредельныйИндекс.ТолькоПросмотр                           = Ложь;
		Элементы.ЛицевыеСчетаНачисленоПоУслугеДо.ТолькоПросмотр                        = Ложь;
		Элементы.ЛицевыеСчетаНачисленоПоУслуге.ТолькоПросмотр                          = Ложь;
		Элементы.ЛицевыеСчетаПревышение.ТолькоПросмотр                                 = Ложь;
		Элементы.ЛицевыеСчетаПревышениеВПроцентах.ТолькоПросмотр                       = Ложь;
		Элементы.ЛицевыеСчетаСуммаНедополученныхДоходов.ТолькоПросмотр                 = Ложь;
		
	Иначе
		
		Элементы.ЛицевыеСчетаЛицевойСчет.ТолькоПросмотр                                = Истина;
		Элементы.ЛицевыеСчетаГруппаУслуги.ТолькоПросмотр                               = Истина;
		Элементы.ЛицевыеСчетаУслуга.ТолькоПросмотр                                     = Истина; 
		Элементы.ЛицевыеСчетаПоставщик.ТолькоПросмотр                                  = Истина;
		Элементы.ЛицевыеСчетаЕдИзм.ТолькоПросмотр                                      = Истина;
		Элементы.ЛицевыеСчетаПериодСравнения.ТолькоПросмотр                            = Истина;
		Элементы.ЛицевыеСчетаКоличество.ТолькоПросмотр                                 = Истина;
		Элементы.ЛицевыеСчетаСтавкаДействующаяВПериодеСравнения.ТолькоПросмотр         = Истина;
		Элементы.ЛицевыеСчетаСтавкаДействующаяВТекущемПериоде.ТолькоПросмотр           = Истина;
		Элементы.ЛицевыеСчетаНорма.ТолькоПросмотр                                      = Истина;
		Элементы.ЛицевыеСчетаНормативДействующийВПериодеСравнения.ТолькоПросмотр       = Истина;
		Элементы.ЛицевыеСчетаНормативДействующийВТекущемПериоде.ТолькоПросмотр         = Истина;
		Элементы.ЛицевыеСчетаСверхНорма.ТолькоПросмотр                                 = Истина;
		Элементы.ЛицевыеСчетаПлановаяСтавкаДействующаяВПериодеСравнения.ТолькоПросмотр = Истина;
		Элементы.ЛицевыеСчетаПлановаяСтавкаДействующаяВТекущемПериоде.ТолькоПросмотр   = Истина;
		Элементы.ЛицевыеСчетаТарифДействующийВПериодеСравнения.ТолькоПросмотр          = Истина;
		Элементы.ЛицевыеСчетаТарифДействующийВТекущемПериоде.ТолькоПросмотр            = Истина;
		Элементы.ЛицевыеСчетаОбъемПоНормативамДо.ТолькоПросмотр                        = Истина;
		Элементы.ЛицевыеСчетаОбъемПоНормативам.ТолькоПросмотр                          = Истина;
		Элементы.ЛицевыеСчетаОбъем.ТолькоПросмотр                                      = Истина;
		Элементы.ЛицевыеСчетаПредельныйИндекс.ТолькоПросмотр                           = Истина;
		Элементы.ЛицевыеСчетаНачисленоПоУслугеДо.ТолькоПросмотр                        = Истина;
		Элементы.ЛицевыеСчетаНачисленоПоУслуге.ТолькоПросмотр                          = Истина;
		Элементы.ЛицевыеСчетаПревышение.ТолькоПросмотр                                 = Истина;
		Элементы.ЛицевыеСчетаПревышениеВПроцентах.ТолькоПросмотр                       = Истина;
		Элементы.ЛицевыеСчетаСуммаНедополученныхДоходов.ТолькоПросмотр                 = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
